trade_exp/src/DataProcessors/ПечатьЭтикетокИЦенников/ПечатьЭтикетокИЦенников.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ПечатьЭтикетокИЦенников</name>
  <objectBelonging>Adopted</objectBelonging>
  <attributes>
    <name>ВидЦеныДополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ВидЦены</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Организация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ПравилоОбмена</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>РежимПолученияЦен</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <numberQualifiers>
          <precision>1</precision>
        </numberQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Дата</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>Склад</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>ДатаДополнительно</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <dateQualifiers>
          <dateFractions>Date</dateFractions>
        </dateQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes>
    <name>ТиповоеСоглашение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes>
    <name>Подразделение</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections>
    <name>Товары</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes>
      <name>ШаблонЭтикетки</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ШаблонЦенника</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Номенклатура</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Цена</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоВДокументе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Характеристика</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ОстатокНаСкладе</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>15</precision>
            <scale>3</scale>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Упаковка</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>Штрихкод</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>Весовой</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>ЦенаДополнительно</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes>
      <name>КоличествоЦенников</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes>
      <name>КоличествоЭтикеток</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>10</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="2bcb13a5-ad79-4c3d-b94e-d59d381eb43c">
      <name>Серия</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
  </tabularSections>
</mdclass:DataProcessor>

trade_exp/src/InformationRegisters/ШтрихкодыНоменклатуры/ШтрихкодыНоменклатуры.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ШтрихкодыНоменклатуры</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <informationRegisterPeriodicity>Checked</informationRegisterPeriodicity>
    <writeMode>Checked</writeMode>
  </extension>
  <resources>
    <name>Характеристика</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Упаковка</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Номенклатура</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <resources>
    <name>Наш</name>
    <objectBelonging>Adopted</objectBelonging>
  </resources>
  <attributes extendedConfigurationObject="a9733f12-e26b-44d6-8c73-49b629ab1280">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <dimensions>
    <name>Штрихкод</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>200</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </dimensions>
</mdclass:InformationRegister>

trade_exp/src/Catalogs/ДополнительныеОтчетыИОбработки/ДополнительныеОтчетыИОбработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog xmlns:mdclassExtension="http://g5.1c.ru/v8/dt/metadata/mdclass/extension">
  <name>ДополнительныеОтчетыИОбработки</name>
  <objectBelonging>Adopted</objectBelonging>
  <extension>
    <hierarchical>Checked</hierarchical>
  </extension>
  <hierarchical>true</hierarchical>
  <attributes extendedConfigurationObject="3c54d440-e908-43d6-a5cc-bb64620c82d7">
    <name>Комментарий</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="bf1dd911-8ee1-407b-acae-10c85b74baf3">
    <name>Публикация</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="fdbbbf8b-dacf-436e-8d8b-1e2b8e854b17">
    <name>ИспользоватьДляФормыСписка</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="66364cd4-aaa5-421d-96d6-3c283c14650d">
    <name>ИспользоватьДляФормыОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ebef37c6-4808-4683-93be-036ce19cafd5">
    <name>Информация</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>1024</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="532637ef-be0d-4f42-9747-a88e17eb3def">
    <name>Версия</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="61127152-3e24-40b4-8a23-5eb6cae568ff">
    <name>Вид</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="ad1142ed-183d-47a3-800c-997a3770e11e">
    <name>ИмяФайла</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>260</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="ffd987e3-e8af-4d46-881e-1e312e74dbac">
    <name>ИмяОбъекта</name>
    <objectBelonging>Adopted</objectBelonging>
    <extension>
      <typeExtension>
        <stringQualifiers>
          <length>256</length>
        </stringQualifiers>
      </typeExtension>
    </extension>
  </attributes>
  <attributes extendedConfigurationObject="23a240a2-52ee-46ab-89d9-50dcee2cc8d2">
    <name>Ответственный</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="7acd5f4d-55de-443c-a5e5-404b1e77d13f">
    <name>ВключитьОграниченияФормирования</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="93e9c43a-d522-4b3f-8faa-3e0a83aa610e">
    <name>ТолькоНаБазеTrade</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <attributes extendedConfigurationObject="136703ac-c000-4bb3-b150-be3adc900fdb">
    <name>ВестиЛогирование</name>
    <objectBelonging>Adopted</objectBelonging>
  </attributes>
  <tabularSections extendedConfigurationObject="0481bc65-6a32-46b9-ae87-993ba52a29a5">
    <name>Команды</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="c708f6e9-b7a0-4046-90f3-83527da7b872">
      <name>Представление</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>200</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
  <tabularSections extendedConfigurationObject="00974661-42a8-46e7-9e21-6f9141d0fb48">
    <name>ПараметрыИОтборы</name>
    <objectBelonging>Adopted</objectBelonging>
    <attributes extendedConfigurationObject="315022f6-3549-4d2d-8ada-cdaf7148b493">
      <name>Наименование</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <stringQualifiers>
            <length>100</length>
          </stringQualifiers>
        </typeExtension>
      </extension>
    </attributes>
    <attributes extendedConfigurationObject="c27cc284-6d41-4dcc-a424-f5545e73c073">
      <name>Обязательный</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="86a4432d-ae7d-40f5-bb5d-9f8157f2ff8f">
      <name>ЭтоПараметр</name>
      <objectBelonging>Adopted</objectBelonging>
    </attributes>
    <attributes extendedConfigurationObject="566340cb-bbfc-49cd-850d-dd5cbc126c44">
      <name>ПериодПараметра</name>
      <objectBelonging>Adopted</objectBelonging>
      <extension>
        <typeExtension>
          <numberQualifiers>
            <precision>2</precision>
          </numberQualifiers>
        </typeExtension>
      </extension>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

trade_exp/src/DataProcessors/ПечатьЭтикетокИЦенников/Forms/ФормаПечатиСкладскихЭтикеток/Module.bsl
&НаКлиенте
Процедура Обработать(Команда)
	ОбработатьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОбработатьНаСервере()
	
	ТаблицаНоменклатуры.Очистить();
	НомерСтроки = 2;		
	Пока Истина Цикл
		стрНомерСтроки = XMLСтрока(НомерСтроки);
		
		Код			 		= СокрЛП(ТаблицаПоиска.Область("R"+Строка(стрНомерСтроки)+"C1").Текст);
		Наименование  		= СокрЛП(ТаблицаПоиска.Область("R"+Строка(стрНомерСтроки)+"C2").Текст);
		НомерПартии			= СокрЛП(ТаблицаПоиска.Область("R"+Строка(стрНомерСтроки)+"C3").Текст);
		ДатаИзготовления 	= СокрЛП(ТаблицаПоиска.Область("R"+Строка(стрНомерСтроки)+"C4").Текст);
		КоличествоЭтикеток	= СокрЛП(ТаблицаПоиска.Область("R"+Строка(стрНомерСтроки)+"C5").Текст);
		
		Если ПустаяСтрока(Код) Тогда 
			Прервать;
		КонецЕсли;
		
		Номенклатура = Справочники.Номенклатура.НайтиПоКоду(Код);
		Если Не ЗначениеЗаполнено(Номенклатура) Тогда
			ОбщегоНазначения.СообщитьПользователю(СтрШаблон("Номенклатура: %1 '%2' не найдена!", Код, Наименование));
			УстановитьЦветТекстаДляСтроки(WebЦвета.ТусклоРозовый, стрНомерСтроки);
		Иначе
			НоваяСтрока = ТаблицаНоменклатуры.Добавить();
			НоваяСтрока.НомерСтроки = стрНомерСтроки-1;
			НоваяСтрока.Код = Номенклатура.Код;
			НоваяСтрока.Номенклатура = Номенклатура;
			НоваяСтрока.ИнформацияПоГост = Номенклатура.ГостСТО;
			НоваяСтрока.МассаОбъем = ПолучитьВесОбъем(Код);
			НоваяСтрока.Цвет = ПолучитьЦвет(Код);
			НоваяСтрока.СрокГодности = Номенклатура.СрокГодностиТовара;
			НоваяСтрока.Штрихкод = ПолучитьШтрихкодНоменклатуры(Код);
			НоваяСтрока.ШаблонЭтикетки = Номенклатура.ШаблонЭтикетокДляСклада;
			НоваяСтрока.ДатаИзготовления = ОбщегоНазначенияКлиентСервер.СтрокаВДату(ДатаИзготовления);
			НоваяСтрока.КоличествоЭтикеток = КоличествоЭтикеток;
			НоваяСтрока.НомерПартии = НомерПартии;
			
			Если НоваяСтрока.ДатаИзготовления = Дата(1, 1, 1) Тогда
				Сообщить("По строке №"+Строка(стрНомерСтроки-1)+" дата не была определена");
			КонецЕсли;
			
			ТаблицаПоиска.Область("R"+Строка(стрНомерСтроки)+"C2").Текст = Номенклатура.Наименование;
			УстановитьЦветТекстаДляСтроки(WebЦвета.НейтральноЗеленый, стрНомерСтроки);
		КонецЕсли;
	
		НомерСтроки = НомерСтроки + 1;
	КонецЦикла;	
КонецПроцедуры

&НаСервере
Процедура УстановитьЦветТекстаДляСтроки(Цвет, НомерСтроки)
	
	ТаблицаПоиска.Область("R"+Строка(НомерСтроки)+"C1").ЦветФона = Цвет;
	ТаблицаПоиска.Область("R"+Строка(НомерСтроки)+"C2").ЦветФона = Цвет;
	ТаблицаПоиска.Область("R"+Строка(НомерСтроки)+"C3").ЦветФона = Цвет;
	ТаблицаПоиска.Область("R"+Строка(НомерСтроки)+"C4").ЦветФона = Цвет;
	ТаблицаПоиска.Область("R"+Строка(НомерСтроки)+"C5").ЦветФона = Цвет;

КонецПроцедуры

&НаСервере
Функция ПолучитьВесОбъем(КодНоменклатуры)

	Обработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", "ПечатьСкладскихЭтикетокПоНоменклатуре.epf");
	ОбработкаОбъект = Обработка.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"Выбрать
		|	Настройки.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Настройки.РеквизитДляВесаОбъема КАК РеквизитДляВеса
		|ПОМЕСТИТЬ ВТНастройки
		|ИЗ 
		|	&Настройки КАК Настройки;
		|///////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
		|	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура   
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройки КАК ВТНастройки
		|			ПО ВТНастройки.ВидНоменклатуры = Номенклатура.ВидНоменклатуры
		|		ПО НоменклатураДополнительныеРеквизиты.Ссылка = Номенклатура.Ссылка
		|ГДЕ
		|	Номенклатура.Код = &Код
		|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ВТНастройки.РеквизитДляВеса";
	
	Запрос.УстановитьПараметр("Код", КодНоменклатуры);
	Запрос.УстановитьПараметр("Настройки", Обработка.ХранилищеНастроек.Получить().СопоставлениеВИдовНоменклатурыСРеквизитом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат "";

КонецФункции

&НаСервере
Функция ПолучитьЦвет(КодНоменклатуры)

	Обработка = Справочники.ДополнительныеОтчетыИОбработки.НайтиПоРеквизиту("ИмяФайла", "ПечатьСкладскихЭтикетокПоНоменклатуре.epf");
	ОбработкаОбъект = Обработка.ПолучитьОбъект();
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
		"Выбрать
		|	Настройки.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Настройки.РеквизитДляЦвета КАК РеквизитДляЦвета
		|ПОМЕСТИТЬ ВТНастройки
		|ИЗ 
		|	&Настройки КАК Настройки;
		|///////////////////////////////////////////////////////////
		|ВЫБРАТЬ РАЗЛИЧНЫЕ
		|	НоменклатураДополнительныеРеквизиты.Значение КАК Значение,
		|	НоменклатураДополнительныеРеквизиты.Свойство КАК Свойство,
		|	Номенклатура.ВидНоменклатуры КАК ВидНоменклатуры,
		|	Номенклатура.Ссылка КАК Номенклатура
		|ИЗ
		|	Справочник.Номенклатура.ДополнительныеРеквизиты КАК НоменклатураДополнительныеРеквизиты
		|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.Номенклатура КАК Номенклатура   
		|			ЛЕВОЕ СОЕДИНЕНИЕ ВТНастройки КАК ВТНастройки
		|			ПО ВТНастройки.ВидНоменклатуры = Номенклатура.ВидНоменклатуры
		|		ПО НоменклатураДополнительныеРеквизиты.Ссылка = Номенклатура.Ссылка
		|ГДЕ
		|	Номенклатура.Код = &Код
		|	И НоменклатураДополнительныеРеквизиты.Свойство.Наименование ПОДОБНО ВТНастройки.РеквизитДляЦвета";
	
	Запрос.УстановитьПараметр("Код", КодНоменклатуры);
	Запрос.УстановитьПараметр("Настройки", Обработка.ХранилищеНастроек.Получить().СопоставлениеВИдовНоменклатурыСРеквизитом);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Значение;
	КонецЕсли;
	
	Возврат "";

КонецФункции

&НаСервере
Функция ПолучитьШтрихкодНоменклатуры(КодНоменклатуры)

	Запрос = Новый Запрос;
	Запрос.Текст = 
		"ВЫБРАТЬ первые 1
		|	ШтрихкодыНоменклатуры.Штрихкод КАК Штрихкод,
		|	ШтрихкодыНоменклатуры.Номенклатура КАК Номенклатура,
		|	ШтрихкодыНоменклатуры.Наш КАК Наш
		|ИЗ
		|	РегистрСведений.ШтрихкодыНоменклатуры КАК ШтрихкодыНоменклатуры
		|ГДЕ
		|	НЕ ШтрихкодыНоменклатуры.Наш
		|	И ШтрихкодыНоменклатуры.Штрихкод ПОДОБНО ""4%""
		|	И ШтрихкодыНоменклатуры.Номенклатура.Код = &Код";
	
	Запрос.УстановитьПараметр("Код", КодНоменклатуры);
	
	РезультатЗапроса = Запрос.Выполнить();
	
	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	
	Если ВыборкаДетальныеЗаписи.Следующий() Тогда
		Возврат ВыборкаДетальныеЗаписи.Штрихкод;
	КонецЕсли;
	
	Возврат "";

КонецФункции

&НаКлиенте
Процедура Предпросмотр(Команда)
	ОчиститьСообщения();
	
	ВыполнитьПроверку(ЭтаФорма);
	Если ТаблицаНоменклатуры.Количество() = 0 Тогда
		ПоказатьПредупреждение(Неопределено, НСтр("ru = 'Не выбрано ни одного товара'"));
		Возврат;
	КонецЕсли;
	
	ПараметрКоманды = Новый Массив;
	ПараметрКоманды.Добавить(ПредопределенноеЗначение("Справочник.Номенклатура.ПустаяСсылка"));
	ИменаМакетов = "ЭтикеткаТовары";
	
	УправлениеПечатьюКлиент.ВыполнитьКомандуПечати(
			"Обработка.ПечатьЭтикетокИЦенников",
			ИменаМакетов,
			ПараметрКоманды,
			ЭтаФорма,
			ПолучитьПараметры());

КонецПроцедуры

&НаКлиентеНаСервереБезКонтекста
Функция ВыполнитьПроверку(Форма)
	ЕстьОшибки = Ложь;
	Для Каждого СтрокаТЧ Из Форма.ТаблицаНоменклатуры Цикл
		НомерСтроки = СтрокаТЧ.НомерСтроки - 1;
		Если СтрокаТЧ.КоличествоЭтикеток = 0 Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не заполнено количество этикеток в строке: %1'"),
				НомерСтроки + 1);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,,
				"Объект.Товары["+НомерСтроки+"].КоличествоЭтикеток",,
				ЕстьОшибки);
		КонецЕсли;
		Если НЕ ЗначениеЗаполнено(СтрокаТЧ.ШаблонЭтикетки) Тогда
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = 'Не выбран шаблон этикетки в строке: %1'"),
				НомерСтроки + 1);
			ОбщегоНазначенияКлиентСервер.СообщитьПользователю(
				ТекстСообщения,,
				"Объект.Товары["+НомерСтроки+"].ШаблонЭтикетки",,
				ЕстьОшибки);
		КонецЕсли;	
	КонецЦикла;
	
КонецФункции

&НаСервере
Функция ПолучитьПараметры()
	
	ТоварыДляСкладскихЯчеек = Новый ТаблицаЗначений;
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("Номенклатура", Новый ОписаниеТипов("СправочникСсылка.Номенклатура"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("Характеристика", Новый ОписаниеТипов("СправочникСсылка.ХарактеристикиНоменклатуры"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("Упаковка", Новый ОписаниеТипов("СправочникСсылка.УпаковкиЕдиницыИзмерения"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("Цена", Новый ОписаниеТипов("Число"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ЦенаДополнительно", Новый ОписаниеТипов("Число"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("Штрихкод", Новый ОписаниеТипов("Строка"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ШаблонЦенника", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("КоличествоЦенников", Новый ОписаниеТипов("Число"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ШаблонЭтикетки", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ШаблонЭтикеткиПодготовлено", Новый ОписаниеТипов("СправочникСсылка.ШаблоныЭтикетокИЦенников"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("КоличествоЭтикеток", Новый ОписаниеТипов("Число"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ОстатокНаСкладе", Новый ОписаниеТипов("Число"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("КоличествоВДокументе", Новый ОписаниеТипов("Число"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("Весовой", Новый ОписаниеТипов("Булево"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ДатаПоследнегоИзмененияЦены", Новый ОписаниеТипов("Дата"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ДатаПоследнегоИзмененияЦеныДополнительно", Новый ОписаниеТипов("Дата"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ДатаИзготовления", Новый ОписаниеТипов("Строка"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("ИнформацияПоГост", Новый ОписаниеТипов("Строка"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("НомерПартии", Новый ОписаниеТипов("Число"));
	ТоварыДляСкладскихЯчеек.Колонки.Добавить("СрокГодности", Новый ОписаниеТипов("Число"));
	
	Для Каждого СтрокаТЧ Из ТаблицаНоменклатуры Цикл
		НоваяСтрока = ТоварыДляСкладскихЯчеек.Добавить();
		ЗаполнитьЗначенияСвойств(НоваяСтрока, СтрокаТЧ);
		НоваяСтрока.ДатаИзготовления = Формат(СтрокаТЧ.ДатаИзготовления, "ДФ=dd.MM.yyyy");
		Если НЕ ЗначениеЗаполнено(НоваяСтрока.ШаблонЭтикетки) Тогда
			НоваяСтрока.КоличествоЭтикеток = 0;
		КонецЕсли;
	КонецЦикла;
	
	МаксимальныйКодВесовогоТовара = ПодключаемоеОборудованиеOfflineВызовСервера.МаксимальныйКодВесовогоТовара();
	УстановитьПривилегированныйРежим(Истина);
	ПравилоВыгрузкиВВесы = (ОбщегоНазначения.ЗначениеРеквизитаОбъекта(Объект.ПравилоОбмена, "ТипПодключаемогоОборудования") = Перечисления.ТипыПодключаемогоОборудования.ВесыСПечатьюЭтикеток);
	УстановитьПривилегированныйРежим(Ложь);
	
	СтранаРегистрации = ?(ЗначениеЗаполнено(Объект.Организация), ЗначениеНастроекКлиентСерверПовтИсп.СтранаРегистрацииОрганизации(Объект.Организация), Константы.ОсновнаяСтрана.Получить());
	
	ПараметрыПечати = Новый Структура;
	ПараметрыПечати.Вставить("Товары", ПоместитьВоВременноеХранилище(ТоварыДляСкладскихЯчеек, УникальныйИдентификатор));
	ПараметрыПечати.Вставить("Организация",   Объект.Организация);
	ПараметрыПечати.Вставить("СтранаРегистрации", СтранаРегистрации);
	ПараметрыПечати.Вставить("ПравилоОбмена", Объект.ПравилоОбмена);
	ПараметрыПечати.Вставить("МаксимальныйКодВесовогоТовара", МаксимальныйКодВесовогоТовара);
	ПараметрыПечати.Вставить("ПравилоВыгрузкиВВесы",          ПравилоВыгрузкиВВесы);
	ПараметрыПечати.Вставить("ВидЦены",       Объект.ВидЦены);
	ПараметрыПечати.Вставить("Дата",          Объект.Дата);
	ПараметрыПечати.Вставить("Склад",         Объект.Склад);
	ПараметрыПечати.Вставить("ВидЦеныДополнительно", Объект.ВидЦеныДополнительно);
	ПараметрыПечати.Вставить("ДатаДополнительно",    Объект.ДатаДополнительно);
	ПараметрыПечати.Вставить("СтруктураМакетаШаблона", Неопределено);
	ПараметрыПечати.Вставить("ПринтерИмя",    Принтер);
	
	Возврат ПараметрыПечати;
	
КонецФункции
